Repository: academykit/academykit
Catalog: AcademyKit.Server/Infrastructure/Localization/ExceptionLocalizer.*.resx
Languages: ja_jp, ne_np

source: Exam already taken.
ja_jp: 試験はすでに受けられています
ne_np: परिक्षा लिइसकेको छ ।

source: Exam result not found.
ja_jp: 試験結果が見つかりませんでした
ne_np: परीक्षाको नतिजा फेला परेन।

source: Exam submission not found.
ja_jp: 試験の提出物が見つかりません
ne_np: परीक्षा सबमिशन फेला परेन।

# ExamSubmissionNotMatchQuestionSet
source: Exam submission question doesn't match with question set question.
ja_jp: 試験提出の質問が問題集の質問と一致しません
ne_np: परीक्षा सबमिशन प्रश्न प्रश्न सेट प्रश्नसँग मेल खाँदैन।

source: Feedback contains feedback submissions.
ja_jp: フィードバックにはフィードバックの送信が含まれます
ne_np: प्रतिक्रियामा प्रतिक्रिया सबमिशनहरू समावेश छन्।

# InvalidLessonTypeAssignment
source: Invalid lesson type for assignment.
ja_jp: 課題のレッスン タイプが無効です
ne_np: असाइनमेन्टको लागि अमान्य पाठ प्रकार।

source: Late Submission.
ja_jp: 提出が遅れています
ne_np: ढिलो सबमिशन।

# QuestionPoolAuhorCannotRemoved
source: Question pool author cannot be removed.
ja_jp: 質問プールの作成者は削除できません
ne_np: प्रश्न पूल लेखक हटाउन सकिँदैन।

# QuestionPoolAuthorCanNotAdded
source: Question pool author cannot be added.
ja_jp: 質問プールの作成者は追加できません
ne_np: प्रश्न पूल लेखक थप्न सकिँदैन।

# QuestionPoolContainQuestion
source: Question pool contains questions. So, to delete question pool remove all the questions from pool.
ja_jp: 質問プールには質問が含まれています。したがって、質問プールを削除するには、プールからすべての質問を削除します
ne_np: प्रश्न पूलमा प्रश्नहरू छन्। त्यसैले, प्रश्न पूल मेटाउन पूलबाट सबै प्रश्नहरू हटाउनुहोस्।

# QuestionSetEnded
source: Question set has ended.
ja_jp: 問題集は終了しました
ne_np: प्रश्न सेट समाप्त भयो।

# QuestionSetNotStarted
source: Question set has not started yet.
ja_jp: 質問セットはまだ開始されていません
ne_np: प्रश्न सेट अझै सुरु भएको छैन।

source: Server Access key not found.
ja_jp: サーバーアクセスキーが見つかりません
ne_np: सर्भर पहुँच कुञ्जी फेला परेन।

source: Server bucket not found.
ja_jp: サーバーバケットが見つかりません
ne_np: सर्भर बाल्टी फेला परेन।

source: Server end point not found.
ja_jp: サーバーのエンドポイントが見つかりません
ne_np: सर्भर अन्तिम बिन्दु फेला परेन।

source: Server pre-signed expiry time not found.
ja_jp: サーバーの事前署名された有効期限が見つかりません
ne_np: सर्भर पूर्व-साइन गरिएको म्याद समाप्ति समय फेला परेन।

# ServerPreSignedUlrNotFound
source: Server pre-signed url not found.
ja_jp: サーバーの事前署名された URL が見つかりません
ne_np: सर्भर पूर्व-हस्ताक्षरित url फेला परेन।

source: Server secret key not found.
ja_jp: サーバーの秘密キーが見つかりません
ne_np: सर्भर गोप्य कुञ्जी फेला परेन।

source: Server url not found.
ja_jp: サーバーの URL が見つかりません
ne_np: सर्भर url फेला परेन।

# UserCanNotRemoveSameUser
source: User cannot be removed same user.
ja_jp: 同じユーザーを削除することはできません
ne_np: प्रयोगकर्ता एउटै प्रयोगकर्ता हटाउन सकिँदैन।

# UserImported
source: Successfully user imported.
ja_jp: ユーザーが正常にインポートされました
ne_np: सफलतापूर्वक प्रयोगकर्ता आयात गरियो।

# UserNotEnrolledTraining
source: User is not enrolled in this training.
ja_jp: ユーザーはこのトレーニングに登録されていません
ne_np: प्रयोगकर्ता यस प्रशिक्षणमा नामांकन गरिएको छैन।

# AlreadyEnrolledInTraining
source: You are already enrolled in this training.
ja_jp: あなたはすでにこのトレーニングに登録しています
ne_np: तपाईं पहिले नै यस प्रशिक्षणमा भर्ना हुनुहुन्छ।

source: already exist in another account.
ja_jp: 別のアカウントにすでに存在します
ne_np: पहिले नै अर्को खातामा अवस्थित छ।

# AtLeastOneTrainerSignatureRequired
source: At least one trainer signature detail is required.
ja_jp: 少なくとも 1 つのトレーナー署名の詳細が必要です
ne_np: कम्तिमा एक प्रशिक्षकको हस्ताक्षर विवरण आवश्यक छ।

# AtMostThreeSignaturesAllowed
source: At most 3 signatures are only allowed.
ja_jp: 署名は最大 3 つまでしか許可されません
ne_np: बढीमा ३ हस्ताक्षर मात्र अनुमति छ।

source: Aws Access key not found.
ja_jp: AWS アクセスキーが見つかりません
ne_np: Aws पहुँच कुञ्जी फेला परेन।

source: Aws region end point not found.
ja_jp: AWS リージョンのエンドポイントが見つかりません
ne_np: Aws क्षेत्रको अन्त्य बिन्दु फेला परेन।

source: AWS secret key not found.
ja_jp: AWS 秘密キーが見つかりません
ne_np: AWS गोप्य कुञ्जी फेला परेन।

# CannotEnrolledOnCompletedTraining
source: Cannot enrolled in the training having completed status.
ja_jp: 完了ステータスではトレーニングに登録できません
ne_np: स्थिति पूरा भएपछि तालिममा भर्ना हुन सक्दैन।

# CannotSubmitAssignmentStatusCompleted
source: Cannot submit assignment of the training having completed status.
ja_jp: 完了ステータスのトレーニングの課題を提出することはできません
ne_np: स्थिति पूरा भएपछि तालिमको असाइनमेन्ट पेश गर्न सकिँदैन।

# CeritificateAlreadyApproved
source: Ceritificate with is already approved.
ja_jp: の付いた証明書はすでに承認されています
ne_np: संगको प्रमाणपत्र पहिले नै स्वीकृत छ।

# CurrentUserRequired
source: CurrentUser Id is required.
ja_jp: 現在のユーザー ID は必須です
ne_np: हालको प्रयोगकर्ता आईडी आवश्यक छ।

# CurrentWatchLessonNotFound
source: Current watched lesson not found.
ja_jp: 現在視聴しているレッスンが見つかりません
ne_np: हाल हेरिएको पाठ फेला परेन।

# DepartmentContainsUsersCannotDeleted
source: Department contains users. So, it cannot be deleted.
ja_jp: 部門にはユーザーが含まれています。したがって、削除することはできません
ne_np: विभागले प्रयोगकर्ताहरू समावेश गर्दछ। त्यसैले, यसलाई मेटाउन सकिँदैन।

# DuplicateDepartmentNameFound
source: Duplicate department name is found.
ja_jp: 重複した部署名が見つかりました
ne_np: डुप्लिकेट विभागको नाम फेला पर्यो।

# EmailShouldNotEmpty
source: Email shouldn't be empty.
ja_jp: 電子メールは空であってはなりません
ne_np: इमेल खाली हुनु हुँदैन।

# EnrollmentFoundInTraining
source: Training contains member enrollments. So, it cannot be removed.
ja_jp: トレーニングにはメンバー登録が含まれます。したがって、削除することはできません
ne_np: प्रशिक्षणमा सदस्य नामांकन समावेश छ। त्यसैले, यसलाई हटाउन सकिँदैन।

# EnterUserEmail
source: Please enter user email.
ja_jp: ユーザーのメールアドレスを入力してください
ne_np: कृपया प्रयोगकर्ता इमेल प्रविष्ट गर्नुहोस्।

# ErroprOccurredFetchStudentSubmittedAssignment
source: An error occurred while trying to fetch the student submitted assignment.
ja_jp: 学生が提出した課題を取得しようとしたときにエラーが発生しました
ne_np: विद्यार्थीले पेश गरेको असाइनमेन्ट ल्याउने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccuredSubmitAssignment
source: An error occurred while trying to submit the assignment.
ja_jp: 課題を送信しようとしたときにエラーが発生しました
ne_np: असाइनमेन्ट पेश गर्ने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredRemoveFileFromGroup
source: An error occurred while trying to remove the file from group.
ja_jp: グループからファイルを削除しようとしたときにエラーが発生しました
ne_np: समूहबाट फाइल हटाउन प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredDeleteSignature
source: An error occurred while trying to delete signature in the training.
ja_jp: トレーニングで署名を削除しようとしたときにエラーが発生しました
ne_np: तालिममा हस्ताक्षर मेटाउने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredFetchTrainingUserList
source: An error occurred while trying to fetch training list of the user.
ja_jp: ユーザーのトレーニング リストを取得しようとしたときにエラーが発生しました
ne_np: प्रयोगकर्ताको प्रशिक्षण सूची ल्याउने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredFetchLessonStatistics
source: An error occurred while trying to fetch training lesson statistics.
ja_jp: トレーニング レッスンの統計を取得しようとしたときにエラーが発生しました
ne_np: प्रशिक्षण पाठ तथ्याङ्कहरू ल्याउन प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredFetchTrainingDetail
source: An error occurred while trying to fetch training detail.
ja_jp: トレーニングの詳細を取得しようとしたときにエラーが発生しました
ne_np: तालिमको विवरण ल्याउने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredFetchTrainingSignature
source: An error occurred while trying fetch the training signature.
ja_jp: トレーニング署名を取得しようとしたときにエラーが発生しました
ne_np: तालिम हस्ताक्षर ल्याउने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredFetchTrainingStatistics
source: An error occurred while trying to fetch training statistics.
ja_jp: トレーニング統計を取得しようとしたときにエラーが発生しました
ne_np: प्रशिक्षण तथ्याङ्कहरू ल्याउने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredFetchTrainingStudentStatistics
source: An error occurred while trying to fetch training student statistics.
ja_jp: 研修生の統計を取得しようとしたときにエラーが発生しました
ne_np: प्रशिक्षण विद्यार्थी तथ्याङ्कहरू ल्याउन प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredFetchUserDetails
source: An error occurred while attempting to fetch user detail information.
ja_jp: ユーザーの詳細情報を取得しようとしたときにエラーが発生しました
ne_np: प्रयोगकर्ता विवरण जानकारी ल्याउन प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredFetchGroupFiles
source: An error occurred while trying to fetch the group files.
ja_jp: グループ ファイルを取得しようとしたときにエラーが発生しました
ne_np: समूह फाइलहरू ल्याउन प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredGettingAWsCredential
source: An error occurred while attempting to get the aws credential.
ja_jp: aws 認証情報を取得しようとしたときにエラーが発生しました
ne_np: Aws credential प्राप्त गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredOnCertificateIssued
source: An error occurred while trying to issued the training certificate.
ja_jp: トレーニング証明書を発行しようとしたときにエラーが発生しました
ne_np: तालिम प्रमाणपत्र जारी गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredSubmitAssignmentReview
source: An error occurred while trying to submit assignment review.
ja_jp: 課題レビューを送信しようとしたときにエラーが発生しました
ne_np: असाइनमेन्ट समीक्षा पेश गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredUpdateSignature
source: An error occurred while trying to update signature in the training.
ja_jp: トレーニングで署名を更新しようとしたときにエラーが発生しました
ne_np: तालिममा हस्ताक्षर अद्यावधिक गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredUploadFileToGroup
source: An error occurred while trying to upload the file in the group.
ja_jp: グループにファイルをアップロードしようとしたときにエラーが発生しました
ne_np: समूहमा फाइल अपलोड गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredUploadSignature
source: An error occurred while trying to upload signature in the training.
ja_jp: トレーニングで署名をアップロードしようとしたときにエラーが発生しました
ne_np: तालिममा हस्ताक्षर अपलोड गर्ने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorOccurredVerifyChangeEmailToken
source: An error occurred while attempting to verify change email token.
ja_jp: 電子メール トークンの変更を確認しようとしたときにエラーが発生しました
ne_np: इमेल टोकन परिवर्तन प्रमाणीकरण गर्ने प्रयास गर्दा त्रुटि भयो।

# FeedbackCompletedStatus
source: Cannot submit feedback of the training having completed status.
ja_jp: トレーニングのフィードバックを送信できません 完成した状態
ne_np: तालिम लिएको प्रतिक्रिया पेश गर्न सकिँदैन पूरा स्थिति।

source: Feedback submission not found.
ja_jp: フィードバックの送信が見つかりません
ne_np: प्रतिक्रिया सबमिशन फेला परेन।

source: File not found.
ja_jp: ファイルが見つかりません
ne_np: फाइल फेला परेन।

# GroupMemberAdded
source: Group Member Added Successfully.
ja_jp: グループメンバーが正常に追加されました
ne_np: समूह सदस्य सफलतापूर्वक थपियो।

source: Group member not found.
ja_jp: グループメンバーが見つかりません
ne_np: समूह सदस्य फेला परेन।

# InvalidLessonAssignmentType
source: Invalid lesson type is not assignment.
ja_jp: 無効なレッスン タイプは割り当てではありません
ne_np: अमान्य पाठ प्रकार असाइनमेन्ट होइन।

# InvalidLessonFeedbackType
source: Invalid lesson type for feedback.
ja_jp: フィードバック用のレッスン タイプが無効です
ne_np: प्रतिक्रियाको लागि अमान्य पाठ प्रकार।

# LessonTypeRecordedCannotDeleted
source: Lesson with type recorded cannot be deleted.
ja_jp: タイプを使ったレッスン 記録されたものは削除できません
ne_np: प्रकारको साथ पाठ रेकर्ड मेटाउन सकिँदैन।

# OnlyDraftTrainingDeleted
source: Only training with draft status can be deleted.
ja_jp: 削除できるのはドラフトステータスのトレーニングのみです
ne_np: मस्यौदा स्थिति भएको प्रशिक्षण मात्र मेटाउन सकिन्छ।

# OnlySuperAdminTrainerAllowedToRemoveMember
source: Only user with super-admin or admin or trainer role is allowed to remove member from the group.
ja_jp: スーパー管理者、管理者、またはトレーナーの役割を持つユーザーのみが、グループからメンバーを削除できます
ne_np: सुपर-एडमिन वा प्रशासक वा प्रशिक्षकको भूमिका भएको प्रयोगकर्तालाई मात्र समूहबाट सदस्य हटाउन अनुमति दिइन्छ।

# OnlySuperAdminTrainerAccessToAddMember
source: Only user with super-admin or admin or trainer role is allowed to add member in the group.
ja_jp: スーパー管理者、管理者、またはトレーナーの役割を持つユーザーのみがグループにメンバーを追加できます
ne_np: सुपर-एडमिन वा प्रशासक वा प्रशिक्षकको भूमिका भएको प्रयोगकर्तालाई मात्र समूहमा सदस्य थप्न अनुमति दिइन्छ।

source: Question set submission not found.
ja_jp: 質問セットの提出が見つかりません
ne_np: प्रश्न सेट सबमिशन फेला परेन।

# ReviewAlreadyGivenAssignment
source: Review has been already given to current assignment.
ja_jp: 現在の課題はすでにレビューされています
ne_np: हालको असाइनमेन्टमा समीक्षा पहिले नै दिइएको छ।

source: Signature not found.
ja_jp: 署名が見つかりません
ne_np: हस्ताक्षर फेला परेन।

# TokenSignatureNotFormatted
source: Token signature not properly formatted.
ja_jp: トークン署名が正しくフォーマットされていません
ne_np: टोकन हस्ताक्षर ठीकसँग ढाँचा गरिएको छैन।

# TrainingAssociateToGroupCannotRemoved
source: Some trainings are associated with this group. So, group cannot be removed.
ja_jp: 一部のトレーニングはこのグループに関連付けられています。したがって、グループを削除することはできません
ne_np: केही तालिमहरू यस समूहसँग सम्बन्धित छन्। त्यसैले, समूह हटाउन सकिँदैन।

# TrainingStatusCannotChanged
source: Training with status cannot be changed.
ja_jp: ステータスのあるトレーニングは変更できません
ne_np: स्थिति संग प्रशिक्षण परिवर्तन गर्न सकिदैन।

# TrainingTeacherCannotSubmitAssignment
source: Training teacher cannot submit the assignment.
ja_jp: 研修講師は課題を提出できません
ne_np: तालिम शिक्षकले असाइनमेन्ट पेश गर्न सक्दैन।

# TraningExamCompletedStatus
source: Cannot give exam to the training having completed status.
ja_jp: 研修修了者は試験を受けることができません
ne_np: तालिमको अवस्था पूरा भई परीक्षा दिन नपाउने ।

# UnauthorizedUserToCreateAttachment
source: Unauthorized user to create an attachment in the group.
ja_jp: グループ内に添付ファイルを作成する権限のないユーザー
ne_np: समूहमा संलग्नक सिर्जना गर्न अनधिकृत प्रयोगकर्ता।

# UnauthorizedUserToRemoveFileFromGroup
source: Unauthorized user to remove the file from the group.
ja_jp: 権限のないユーザーがグループからファイルを削除します
ne_np: समूहबाट फाइल हटाउनको लागि अनधिकृत प्रयोगकर्ता।

# UserAlreadyFoundQuestionPool
source: User is already found as question pool.
ja_jp: ユーザーは質問プールとしてすでに見つかりました
ne_np: प्रयोगकर्ता पहिले नै प्रश्न पूलको रूपमा फेला परेको छ

# UserCannotAccessGroup
source: User can't access the group.
ja_jp: ユーザーはグループにアクセスできません
ne_np: प्रयोगकर्ता समूह पहुँच गर्न सक्दैन।

source: User not found with email
ja_jp: 電子メールを含むユーザーが見つかりません
ne_np: इमेलको साथ प्रयोगकर्ता फेला परेन

# InvalidTimeIssue
source: Exam start time and end time must be greater than current time.
ja_jp: 試験の開始時刻と終了時刻は現在時刻よりも後の時刻である必要があります。
ne_np: परीक्षा सुरु हुने समय र अन्त्यको समय हालको समय भन्दा बढी हुनुपर्छ।

# InvalidMeetingTimeIssue
source: Live lesson start time must be greater than curttent time.
ja_jp: ライブ レッスンの開始時間は現在の時間より長くする必要があります。
ne_np: प्रत्यक्ष पाठ सुरु समय वर्तमान समय भन्दा ठूलो हुनुपर्छ।

# DuplicateEmailDetected
source: some rows contained invalid users
ja_jp: これらは重複ユーザーです
ne_np: यी डुप्लिकेट प्रयोगकर्ता हुन्

# NoUserImported
source: Unable to import user due to incorrect file format
ja_jp: ファイル形式が間違っているためユーザーをインポートできません
ne_np: गलत फाइल ढाँचाको कारणले प्रयोगकर्ता आयात गर्न असमर्थ

# CompletedCourseIssue
source: Completed course cannot be modified
ja_jp: 完了したコースは変更できません
ne_np: पूरा भएको पाठ्यक्रम परिमार्जन गर्न सकिँदैन

# TrainingWithDraftStatusCanOnlyRemoved
source: Traning with draft status can only be removed
ja_jp: ドラフトステータスのトレーニングは削除のみ可能です
ne_np: मस्यौदा स्थितिको साथ प्रशिक्षण मात्र हटाउन सकिन्छ

# TraineeCannotBeTrainer
source: Trainee cannot be added as trainer
ja_jp: トレーニーをトレーナーとして追加することはできません
ne_np: प्रशिक्षार्थीलाई प्रशिक्षकको रूपमा थप्न सकिँदैन

# AdminOrSuperAdmin
source: these user were admin or superadmin
ja_jp: これらのユーザーは管理者またはスーパー管理者でした
ne_np: यी प्रयोगकर्ता प्रशासक वा सुपरएडमिन थिए

# AlreadyAddedMember
source: User is already added in group
ja_jp: ユーザーはすでにグループに追加されています
ne_np: प्रयोगकर्ता पहिले नै समूहमा थपिएको छ

# InactiveGroupMember
source: Member is of inactive status
ja_jp: メンバーは非アクティブなステータスです
ne_np: सदस्य निष्क्रिय स्थितिको छ

# NotASystemUser
source: User is not in our system
ja_jp: ユーザーはシステムに存在しません
ne_np: प्रयोगकर्ता हाम्रो प्रणालीमा छैन

# OtherAddedSuccessfully
source: and Other remaining users are added successfully in the group
ja_jp: 他の残りのユーザーはグループに正常に追加されます
ne_np: र अन्य बाँकी प्रयोगकर्ताहरू समूहमा सफलतापूर्वक थपिएका छन्

# CSVNullError
source: Please add users in the CSV file; the file is empty.
ja_jp: CSV ファイルにユーザーを追加してください。ファイルは空です
ne_np: कृपया CSV फाइलमा प्रयोगकर्ताहरू थप्नुहोस्; फाइल खाली छ।

# IncorrectEmail
source: Enter data in the mandatory field Email of row number
ja_jp: 必須フィールドにデータを入力してください 行番号の電子メール
ne_np: पङ्क्ति नम्बरको इमेल अनिवार्य फिल्डमा डाटा प्रविष्ट गर्नुहोस्

# IncorrectEmailFormat
source: Correct Email of row number
ja_jp: 行番号の列電子メールを修正します
ne_np: अवैध इमेल एडरहरू:

# IncorrectFirstName
source: Enter data in the mandatory field FirstName of row number
ja_jp: 行番号の必須フィールドにデータを入力します
ne_np: अनिवार्य फिल्डमा डेटा प्रविष्ट गर्नुहोस् पङ्क्ति नम्बरको पहिलो नाम

# IncorrectLastName
source: Enter data in the mandatory field LastName of row number
ja_jp: 必須フィールドにデータを入力します 行番号の姓
ne_np: पङ्क्ति नम्बरको अन्तिम नाम अनिवार्य फिल्डमा डाटा प्रविष्ट गर्नुहोस्

# IncorrectMobileNumberFormat
source: Correct MobileNumber of row number
ja_jp: 行番号の列 MobileNumber を修正します

# IncorrectRole
source: Enter data in the mandatory field Role of row number
ja_jp: 必須フィールドにデータを入力します 行番号の役割
ne_np: अनिवार्य फिल्डमा डेटा प्रविष्ट गर्नुहोस् पङ्क्ति नम्बरको भूमिका

# IncorrectRoleFormat
source: Correct column Role of row number
ja_jp: 正しい列 行番号の役割
ne_np: पङ्क्ति नम्बरको स्तम्भ भूमिका सही गर्नुहोस्

# QuestionPoolNameLength
source: Name length must be less than or equal to 100 characters.
ja_jp: 名前の長さは 100 文字以下である必要があります。
ne_np: नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# QuestionPoolNameRequired
source: Question pool name is required.
ja_jp: 質問プール名は必須です。
ne_np: प्रश्न पोखरी नाम आवश्यक छ।

# TryAgain
source: and try again.
ja_jp: そしてさらに試みる
ne_np: र फेरि प्रयास गर्नुहोस्।

# ArgumentExceptionMessage
source: Invalid argument provided.
ja_jp: 無効な引数が指定されました。
ne_np: अमान्य तर्क प्रदान गरियो।

# BadRequestError
source: Please check the provided data.
ja_jp: 検証に失敗しました。提供されたデータを確認してください。
ne_np: प्रमाणीकरण असफल भयो। कृपया प्रदान गरिएको डाटा जाँच गर्नुहोस्।

# NorAllowedDroids
source: These aren't the droids you're looking for...
ja_jp: あなたが探しているのはこれらのドロイドではありません...
ne_np: यी तपाईंले खोजिरहनु भएको droids होइनन्...

# NotAllowedToExcessResources
source: You are not allowed to access this resource.
ja_jp: このリソースへのアクセスは許可されていません。

# ServiceExceptionMessage
source: An error occurred while processing the service request.
ja_jp: サービスリクエストの処理中にエラーが発生しました。
ne_np: सेवा अनुरोध प्रशोधन गर्दा त्रुटि भयो।

source: You shall not pass!
ja_jp: 通ることならず！
ne_np: तिमी पास हुने छैनौ!

source: Section name cannot be null
ja_jp: セクション名を null にすることはできません
ne_np: खण्डको नाम शून्य हुन सक्दैन

# AdminCannotSubmitFeedBack
source: Admin or SuperAdmin trainer cannot submit the feedback.
ja_jp: 管理者またはスーパー管理者トレーナーはフィードバックを送信できません。
ne_np: प्रशासक वा सुपरएडमिन प्रशिक्षकले प्रतिक्रिया पेश गर्न सक्दैन।

# AssignmentContainsSubmission
source: Assignment contains submission for lesson with type:
ja_jp: 課題には、次のタイプのレッスンの提出物が含まれています。
ne_np: असाइनमेन्टमा प्रकारको साथ पाठको लागि सबमिशन समावेश छ:

# ContainsUsers
source: The lesson contains submission so the lesson cannot be deleted
ja_jp: レッスンには提出物が含まれているため、レッスンを削除できません
ne_np: पाठमा सबमिशन समावेश छ त्यसैले पाठ मेटाउन सकिँदैन

# EnrolledUserCan'tBeTrainer
source: User is enrolled as trainee. So, it cannot be added as trainer.
ja_jp: ユーザーは研修生として登録されています。したがって、トレーナーとして追加することはできません。
ne_np: प्रयोगकर्ता प्रशिक्षार्थी रूपमा नामांकन गरिएको छ। त्यसकारण, यसलाई प्रशिक्षकको रूपमा थप्न सकिँदैन।

# ExamCannotBeDeleted
source: contains exam submission. So, it cannot be deleted.
ja_jp: 試験の提出が含まれます。したがって、削除することはできません。
ne_np: परीक्षा सबमिशन समावेश गर्दछ। त्यसैले, यसलाई मेटाउन सकिँदैन।

# FeedBackContainsSubmission
source: Feedback contains submission.So, it cannot be deleted.
ja_jp: フィードバックには投稿が含まれているため、削除することはできません。
ne_np: प्रतिक्रियामा सबमिशन समावेश छ। त्यसैले, यसलाई मेटाउन सकिँदैन।

source: Lesson with type
ja_jp: タイプを使ったレッスン
ne_np: प्रकारको साथ पाठ

source: Admin cannot add admin.
ja_jp: 管理者は管理者を追加できません
ne_np: प्रशासकले प्रशासक थप्न सक्दैन

# CannotAddSignatureWithoutCertificate
source: Please add certificate before adding signature.
ja_jp: 署名を追加する前に証明書を追加してください。
ne_np: कृपया हस्ताक्षर थप्नु अघि प्रमाणपत्र थप्नुहोस्।

# AddingDuratrionError
source: Adding duration exceeds the end date.
ja_jp: 期間を追加すると終了日を超えます。
ne_np: अवधि थप्दा अन्तिम मिति नाघ्यो।

# EmptyFile
source: The file is empty.
ja_jp: ファイルは空です。
ne_np: फाइल खाली छ।

# AssignmentStartTimeException
source: The assignment has not started yet.
ja_jp: 課題はまだ始まっていません。
ne_np: कार्यभार अझै सुरु भएको छैन।

# SuccessfulAttendance
source: Successfully attended the lesson.
ja_jp: 無事にレッスンに参加できました。
ne_np: पाठमा सफलतापूर्वक उपस्थित हुनुभयो।

source: successfully reviewed.
ja_jp: 無事にレビューされました。
ne_np: सफलतापूर्वक समीक्षा गरियो।

# QuestionPoolQuestionNotFound
source: Question Pool question was not found.
ja_jp: 質問プールの質問が見つかりませんでした。
ne_np: प्रश्न पूल प्रश्न फेला परेन।

# QuestionpoolUpdatedSuccesfully
source: Question pool questions updated successfully.
ja_jp: 質問プールの質問が正常に更新されました。
ne_np: प्रश्न पूल प्रश्नहरू सफलतापूर्वक अपडेट गरियो।

source: Assignment Updated Successfully.
ja_jp: 割り当てが正常に更新されました。
ne_np: असाइनमेन्ट सफलतापूर्वक अद्यावधिक गरियो।

# AlreadyEnrolledUser
source: Already enrolled email or mobile number :
ja_jp: すでに登録されているメールアドレスまたは携帯電話番号:
ne_np: पहिले नै नामांकन गरिएको इमेल वा मोबाइल नम्बर:

# InvalidEmailFormat
source: Invalid email adderss :
ja_jp: 無効なメールアドレス:
ne_np: अवैध इमेल एडर र मोबाइल नम्बर:

source: Training published successfully.
ja_jp: トレーニングは正常に公開されました。
ne_np: प्रशिक्षण सफलतापूर्वक प्रकाशित।

source: New group member :
ja_jp: 新しいグループメンバー:
ne_np: नयाँ समूह सदस्य:

source: Updated deleted user :
ja_jp: 削除されたユーザーを更新しました:
ne_np: अपडेट गरिएको मेटाइएको प्रयोगकर्ता:

# UpdatedUser
source: Enrolled group member:
ja_jp: 登録されているグループメンバー:
ne_np: नामांकन गरिएको समूह सदस्य:

# LessonContainsAttendance
source: Physical lesson contains attendance.
ja_jp: 体育の授業には出席が含まれます。
ne_np: शारीरिक पाठमा उपस्थिति समावेश छ।

source: Duplicate member Id Found.
ja_jp: 重複するメンバー ID が見つかりました。
ne_np: डुप्लिकेट सदस्य आईडी फेला पर्यो।

source: new enrolled user:
ja_jp: 新規登録ユーザー:
ne_np: नयाँ भर्ना भएका प्रयोगकर्ता:

source: Enrollment for
ja_jp: 登録対象者
ne_np: नामांकनका लागि

# HasBeenSuccessful
source: has been successfully completed.
ja_jp: 無事に完了しました。
ne_np: सफलतापूर्वक सम्पन्न भएको छ।

source: users
ja_jp: ユーザー
ne_np: प्रयोगकर्ताहरू

source: Token verified successfully.
ja_jp: トークンが正常に検証されました。
ne_np: टोकन सफलतापूर्वक प्रमाणित भयो।

# InvalidZoomLicenseEmail
source: Zoom license for email not found.
ja_jp: 電子メール用の Zoom ライセンスが見つかりません。
ne_np: इमेलको लागि जुम इजाजतपत्र फेला परेन।

# ZoomLicenseEmailAlreadyUsed
source: Zoom License Email is already used.
ja_jp: Zoomライセンスメールはすでに使用されています。
ne_np: जुम लाइसेन्स इमेल पहिले नै प्रयोग गरिएको छ।

# AssessmentCannotBeDeleted
source: Assessment Conatins Submission so Cannot be Deleted.
ja_jp: 評価に提出物が含まれているため、削除できません
ne_np: मूल्याङ्कनले सबमिशन समावेश गर्दछ त्यसैले मेट्न सकिदैन

source: Assessment published successfully.
ja_jp: 評価が無事に公開されました。
ne_np: मूल्यांकन सफलतापूर्वक प्रकाशित गरियो।
