Repository: academykit/academykit
Catalog: AcademyKit.Server/Infrastructure/Localization/ExceptionLocalizer.*.resx
Languages: ja_jp, ne_np

# TrainingRemoved
source: Training removed successfully.
ja_jp: トレーニングは正常に削除されました。
ne_np: तालिम सफलतापूर्वक हटाइयो।

# TokenRequired
source: Token is required.
ja_jp: トークンが必要です。
ne_np: टोकन आवश्यक छ।

source: Token not matched.
ja_jp: トークンが一致しません。
ne_np: टोकन मिलेन।

# LogoutSuccess
source: Logout successfully.
ja_jp: ログアウトに成功しました。
ne_np: सफलतापूर्वक लगआउट गर्नुहोस्।

source: User not found.
ja_jp: ユーザーが見つかりません。
ne_np: प्रयोगकर्ता फेला परेन।

# ForgetPasswordExecuted
source: Forgot password executed successfully.
ja_jp: パスワードを忘れた場合は正常に実行されました。
ne_np: पासवर्ड बिर्सनुभयो सफलतापूर्वक कार्यान्वयन गरियो।

# PasswordResetTokenMatched
source: Password reset token matched successfully.
ja_jp: パスワード リセット トークンが正常に一致しました。
ne_np: पासवर्ड रिसेट टोकन सफलतापूर्वक मिल्यो।

source: Token expired.
ja_jp: トークンの有効期限が切れました。
ne_np: टोकनको म्याद सकियो।

# PasswordResetSuccess
source: Password reset successfully.
ja_jp: パスワードが正常にリセットされました。
ne_np: पासवर्ड सफलतापूर्वक रिसेट गरियो।

# PasswordChanged
source: Password changed successfully.
ja_jp: パスワードは正常に変更されました。
ne_np: पासवर्ड सफलतापूर्वक परिवर्तन भयो।

source: Account not registered.
ja_jp: アカウントが登録されていません。
ne_np: खाता दर्ता भएको छैन।

# AccountNotActive
source: Inactive user account.
ja_jp: 非アクティブなユーザー アカウント。
ne_np: निष्क्रिय प्रयोगकर्ता खाता।

# IncorrectCredentials
source: Incorrect User Credentials.
ja_jp: ユーザー認証情報が正しくありません。
ne_np: गलत प्रयोगकर्ता प्रमाणहरू।

source: Token not found.
ja_jp: トークンが見つかりません。
ne_np: टोकन फेला परेन।

source: Token Not Active.
ja_jp: トークンがアクティブではありません。
ne_np: टोकन सक्रिय छैन।

# CSVFileExtension
source: File extension should be csv format.
ja_jp: ファイルの拡張子はcsv形式にしてください。
ne_np: फाइल विस्तार csv ढाँचा हुनुपर्छ।

# AlreadyRegistered
source: User is Already regestered
ja_jp: すでに登録されているユーザー：
ne_np: すでに登録されているユーザー：

source: Reset token not matched.
ja_jp: リセットトークンが一致しません。
ne_np: हालको पासवर्ड मिलेको छैन।

source: Reset token expired.
ja_jp: リセットトークンの有効期限が切れました。
ne_np: रिसेट टोकनको म्याद सकियो।

# CurrentPasswordNotMatched
source: Current Password does not match.
ja_jp: 現在のパスワードが一致しません。

source: Password not matched.
ja_jp: パスワードが一致しません。
ne_np: पासवर्ड मिलेन।

source: Duplicate email found.
ja_jp: 重複したメールが見つかりました
ne_np: डुप्लिकेट इमेल भेटियो।

source: Training not found.
ja_jp: トレーニングが見つかりません
ne_np: तालिम भेटिएन।

# AssignmentRemoved
source: Assignment removed successfully.
ja_jp: 割り当ては正常に削除されました
ne_np: असाइनमेन्ट सफलतापूर्वक हटाइयो।

# AssignmentSubmitted
source: Assignment submitted successfully.
ja_jp: 課題は正常に提出されました
ne_np: असाइनमेन्ट सफलतापूर्वक पेस गरियो।

# CommentRemoved
source: Comment removed successfully.
ja_jp: コメントは正常に削除されました
ne_np: टिप्पणी सफलतापूर्वक हटाइयो।

# CommentReplyRemoved
source: Comment reply removed successfully.
ja_jp: コメント返信は正常に削除されました
ne_np: टिप्पणी जवाफ सफलतापूर्वक हटाइयो।

# DepartmentRemoved
source: Department removed successfully.
ja_jp: 部門が正常に削除されました
ne_np: विभाग सफलतापूर्वक हटाइयो।

# EmailChanged
source: Email changed successfully.
ja_jp: メールアドレスが正常に変更されました
ne_np: इमेल सफलतापूर्वक परिवर्तन भयो।

# FeedbackRemoved
source: Feedback removed successfully.
ja_jp: フィードバックは正常に削除されました
ne_np: प्रतिक्रिया सफलतापूर्वक हटाइयो।

# FeedbackSubmitted
source: Feedback submitted Successfully.
ja_jp: フィードバックは正常に送信されました
ne_np: प्रतिक्रिया सफलतापूर्वक पेश गरियो।

# GroupRemoved
source: Group removed successfully.
ja_jp: グループは正常に削除されました
ne_np: समूह सफलतापूर्वक हटाइयो।

# LessonRemoved
source: Lesson removed successfully.
ja_jp: レッスンは正常に削除されました
ne_np: पाठ सफलतापूर्वक हटाइयो।

# LessonReorder
source: Lesson reorder successfully.
ja_jp: レッスンの再注文が正常に完了しました
ne_np: पाठ सफलतापूर्वक पुन: क्रमबद्ध।

# MemberRemoved
source: Member removed successfully.
ja_jp: メンバーが正常に削除されました
ne_np: सदस्य सफलतापूर्वक हटाइयो।

# MemberStatus
source: Member status changed successfully.
ja_jp: メンバーステータスが正常に変更されました
ne_np: सदस्य स्थिति सफलतापूर्वक परिवर्तन भयो।

# QuestionpoolRemoved
source: QuestionPool removed successfully.
ja_jp: 質問プールは正常に削除されました
ne_np: प्रश्नपुल सफलतापूर्वक हटाइयो।

# QuestionpoolTeacherRemoved
source: Question pool teacher removed successfully.
ja_jp: 質問プールの教師が正常に削除されました
ne_np: प्रश्न पूल शिक्षक सफलतापूर्वक हटाइयो।

source: Question removed successfully.
ja_jp: 質問は正常に削除されました
ne_np: प्रश्न सफलतापूर्वक हटाइयो।

# QuestionSetAnswer
source: Question set answer submitted successfully.
ja_jp: 質問セットの回答が正常に送信されました
ne_np: प्रश्न सेट उत्तर सफलतापूर्वक पेश गरियो।

# SectionRemoved
source: Section removed successfully.
ja_jp: セクションが正常に削除されました
ne_np: खण्ड सफलतापूर्वक हटाइयो।

# SectionReorder
source: Section reorder successfully.
ja_jp: セクションの並べ替えが正常に完了しました
ne_np: खण्ड सफलतापूर्वक पुन: क्रमबद्ध।

# SignatureRemoved
source: Signature removed successfully.
ja_jp: 署名は正常に削除されました
ne_np: हस्ताक्षर सफलतापूर्वक हटाइयो।

# TrainingStatus
source: Training status changed successfully.
ja_jp: トレーニングステータスが正常に変更されました
ne_np: प्रशिक्षण स्थिति सफलतापूर्वक परिवर्तन भयो।

# TrainingTrainer
source: Training trainer removed successfully.
ja_jp: トレーニング トレーナーが正常に削除されました
ne_np: प्रशिक्षण प्रशिक्षक सफलतापूर्वक हटाइयो।

# TrainingUpdated
source: Training updated successfully.
ja_jp: トレーニングが正常に更新されました
ne_np: प्रशिक्षण सफलतापूर्वक अद्यावधिक गरियो।

# UserEnrolled
source: User successfully enrolled in the training.
ja_jp: ユーザーはトレーニングに正常に登録されました
ne_np: प्रयोगकर्ता सफलतापूर्वक प्रशिक्षण मा नामांकन।

# WatchHistory
source: Watch history updated successfully.
ja_jp: 視聴履歴が正常に更新されました
ne_np: हेराइको इतिहास सफलतापूर्वक अपडेट गरियो।

# ZoomLicense
source: Zoom license removed successfully.
ja_jp: ズームライセンスが正常に削除されました
ne_np: जुम लाइसेन्स सफलतापूर्वक हटाइयो।

# AssignmentSubmission
source: Assignment contains assignment submissions. So, it cannot be deleted.
ja_jp: 課題には課題の提出が含まれます。したがって、削除することはできません
ne_np: असाइनमेन्टमा असाइनमेन्ट सबमिशनहरू समावेश छन्।

# CannotAccess
source: Cannot excess
ja_jp: を超えることはできません
ne_np: अति गर्न मिल्दैन

source: Certificate not found.
ja_jp: 証明書が見つかりません
ne_np: प्रमाणपत्र फेला परेन।

# CertificateNotVerified
source: Certificate is not verified.
ja_jp: 証明書が検証されていません
ne_np: प्रमाणपत्र प्रमाणित छैन।

source: Comment not found.
ja_jp: コメントが見つかりません
ne_np: टिप्पणी फेला परेन

source: Comment reply not found.
ja_jp: コメント返信が見つかりません
ne_np: टिप्पणी जवाफ फेला परेन।

# FeedBackCannotReSubmit
source: Feedback cannot be re-submitted.
ja_jp: フィードバックは再送信できません
ne_np: प्रतिक्रिया पुन: पेस गर्न सकिँदैन।

source: Feedback report not found.
ja_jp: フィードバックレポートが見つかりません
ne_np: प्रतिक्रिया रिपोर्ट फेला परेन।

# FilePresignedUrlError
source: An error occurred while getting file presigned url.
ja_jp: ファイル署名付き URL の取得中にエラーが発生しました
ne_np: फाइल presigned url प्राप्त गर्दा त्रुटि भयो।

source: Group not found.
ja_jp: グループが見つかりません
ne_np: समूह फेला परेन।

source: Lesson not found.
ja_jp: レッスンが見つかりませんでした
ne_np: पाठ फेला परेन।

source: Lesson not published.
ja_jp: レッスンは公開されていません
ne_np: पाठ प्रकाशित भएको छैन।

# QuestionPoolModifyNotAllowed
source: You are not allowed to modify this question pool.
ja_jp: この質問プールを変更することはできません
ne_np: तपाइँलाई यो प्रश्न पूल परिमार्जन गर्न अनुमति छैन।

# RecordingFileinS3BucketSave
source: An error occurred while trying to save recording file in s3 bucket.
ja_jp: 録画ファイルを s3 バケットに保存しようとしたときにエラーが発生しました
ne_np: s3 बाल्टीमा रेकर्डिङ फाइल बचत गर्ने प्रयास गर्दा एउटा त्रुटि भयो।

# RemoveReplyBeforeComment
source: Please remove the reply before removing comment.
ja_jp: コメントを削除する前に返信を削除してください
ne_np: कृपया टिप्पणी हटाउनु अघि जवाफ हटाउनुहोस्।

# S3BucketSave
source: An error occurred while trying to save file in s3 bucket.
ja_jp: s3 バケットにファイルを保存しようとしたときにエラーが発生しました
ne_np: s3 बाल्टीमा फाइल बचत गर्ने प्रयास गर्दा एउटा त्रुटि भयो।

# S3PreSigned
source: An error occurred while trying to get s3 pre-signed file url
ja_jp: s3 署名済みファイルの URL を取得しようとしたときにエラーが発生しました
ne_np: s3 पूर्व-हस्ताक्षरित फाइल url प्राप्त गर्ने प्रयास गर्दा त्रुटि भयो

# SameUserRemoved
source: User cannot be removed same user.
ja_jp: 同じユーザーを削除することはできません
ne_np: प्रयोगकर्ता एउटै प्रयोगकर्ता हटाउन सकिँदैन।

# StudentListFetchError
source: An error occurred while trying to fetch the student list who has submitted feedback.
ja_jp: フィードバックを送信した学生リストを取得しようとしたときにエラーが発生しました
ne_np: प्रतिक्रिया पेस गर्ने विद्यार्थी सूची ल्याउने प्रयास गर्दा त्रुटि भयो।

# SubmitFeedBackError
source: An error occurred while trying to submit the feedback.
ja_jp: フィードバックを送信しようとしたときにエラーが発生しました
ne_np: प्रतिक्रिया पेश गर्ने प्रयास गर्दा त्रुटि भयो।

# TraineeAsTrainingTrainerNotAdded
source: User with trainee role is not allowed to add as training trainer.
ja_jp: 研修生の役割を持つユーザーはトレーニング トレーナーとして追加できません
ne_np: प्रशिक्षार्थी भूमिका भएका प्रयोगकर्तालाई प्रशिक्षण प्रशिक्षकको रूपमा थप्न अनुमति छैन।

# TrainerNotAllowedDepartmentUser
source: Trainee are not allowed to see department user.
ja_jp: 研修生は部門のユーザーと会うことはできません
ne_np: प्रशिक्षार्थीलाई विभाग प्रयोगकर्ता हेर्न अनुमति छैन।

# TrainingAccessNotAllowed
source: You are not allowed to access this training.
ja_jp: このトレーニングへのアクセスは許可されていません
ne_np: तपाइँलाई यो प्रशिक्षण पहुँच गर्न अनुमति छैन।

# TrainingAuthorAdded
source: Training author cannot be added.
ja_jp: トレーニング作成者を追加できません
ne_np: प्रशिक्षण लेखक थप्न सकिँदैन।

# TrainingAuthorRemoved
source: Training author cannot be removed.
ja_jp: トレーニング作成者は削除できません
ne_np: प्रशिक्षण लेखक हटाउन सकिँदैन।

# TrainingCompletePercentage
source: An error occurred while trying to calculate training completed percentage.
ja_jp: トレーニング完了率を計算中にエラーが発生しました
ne_np: तालिम पूरा भएको प्रतिशत गणना गर्ने प्रयास गर्दा त्रुटि भयो।

# TrainingModifyNotAllowed
source: You are not allowed to modify this training.
ja_jp: このトレーニングを変更することはできません
ne_np: तपाईंलाई यो प्रशिक्षण परिमार्जन गर्न अनुमति छैन।

# TrainingTrainerCannotSubmitFeedback
source: Training trainer cannot submit the feedback.
ja_jp: トレーニング トレーナーはフィードバックを送信できません
ne_np: तालिम प्रशिक्षकले प्रतिक्रिया पेश गर्न सक्दैन।

source: Unauthorized user.
ja_jp: 不正なユーザー
ne_np: अनाधिकृत प्रयोगकर्ता।

# UnauthorizedUserAddedTrainer
source: Unauthorized user to added as trainer in group course
ja_jp: グループコースにトレーナーとして追加する権限のないユーザー
ne_np: समूह पाठ्यक्रममा प्रशिक्षकको रूपमा थपिने अनधिकृत प्रयोगकर्ता

# UnauthorizedUserDeleteComment
source: Unauthorized user to delete comment.
ja_jp: 権限のないユーザーがコメントを削除できます
ne_np: टिप्पणी मेटाउन अनाधिकृत प्रयोगकर्ता।

# UnauthorizedUserEditComment
source: Unauthorized user to edit comment.
ja_jp: 権限のないユーザーがコメントを編集できます
ne_np: टिप्पणी सम्पादन गर्न अनधिकृत प्रयोगकर्ता।

# UpdateFeedBackError
source: An error occurred while trying to update feedback.
ja_jp: フィードバックを更新しようとしたときにエラーが発生しました
ne_np: प्रतिक्रिया अद्यावधिक गर्ने प्रयास गर्दा त्रुटि भयो।

# UploadFileinServerError
source: An error occurred while attempting to upload file to the server.
ja_jp: ファイルをサーバーにアップロードしようとしたときにエラーが発生しました
ne_np: सर्भरमा फाइल अपलोड गर्ने प्रयास गर्दा त्रुटि भयो।

# UserFoundasTrainingTrainer
source: User is already found as training trainer.
ja_jp: ユーザーはすでにトレーニング トレーナーとして検出されています
ne_np: प्रयोगकर्ता पहिले नै प्रशिक्षण प्रशिक्षकको रूपमा फेला परेको छ।

# AssignmentReviewDeleted
source: Assignment review deleted successfully.
ja_jp: 課題レビューが正常に削除されました
ne_np: असाइनमेन्ट समीक्षा सफलतापूर्वक मेटाइयो।

# AssignmentReviewed
source: Assignment reviewed successfully.
ja_jp: 課題のレビューが正常に完了しました
ne_np: असाइनमेन्ट सफलतापूर्वक समीक्षा गरियो।

# AssignmentReviewUpdate
source: Assignment review update successfully.
ja_jp: 課題レビューが正常に更新されました
ne_np: असाइनमेन्ट समीक्षा सफलतापूर्वक अद्यावधिक गरियो।

# AtleastOneQuestionRequired
source: At least one question is required.
ja_jp: 少なくとも 1 つの質問が必要です
ne_np: कम्तिमा एउटा प्रश्न आवश्यक छ।

# CourseCompleted
source: Course is completed.
ja_jp: コースが完了しました
ne_np: पाठ्यक्रम पूरा भएको छ।

# GeneralSettingNotFound
source: General setting was not found.
ja_jp: 一般設定が見つかりませんでした
ne_np: सामान्य सेटिङ फेला परेन।

# GenerateZakTokenError
source: An error occurred while attempting to generate zak token.
ja_jp: ZAK トークンを生成しようとしたときにエラーが発生しました
ne_np: zak टोकन उत्पन्न गर्ने प्रयास गर्दा त्रुटि भयो।

# OnlySameUserOrAdmin
source: Only same user is allowed to update user or by admin only.
ja_jp: 同じユーザーのみがユーザーまたは管理者のみを更新できます
ne_np: केवल एउटै प्रयोगकर्तालाई प्रयोगकर्ता वा प्रशासक द्वारा मात्र अद्यावधिक गर्न अनुमति छ।

source: Question pool not found.
ja_jp: 質問プールが見つかりません
ne_np: प्रश्न पोखरी फेला परेन।

source: Section not found.
ja_jp: セクションが見つかりません
ne_np: खण्ड फेला परेन।

# SMTPSettingNotFound
source: SMTP setting was not found.
ja_jp: SMTP設定が見つかりませんでした
ne_np: SMTP सेटिङ फेला परेन।

# TimeSpanAlreadyUsed
source: Time span is already used, try another instance.
ja_jp: 期間はすでに使用されています。別のインスタンスを試してください
ne_np: समय अवधि पहिले नै प्रयोग गरिएको छ, अर्को उदाहरण प्रयास गर्नुहोस्।

# TraineeRoleNotAllowed
source: User with trainee role is not allowed to add as exam pool creator.
ja_jp: 研修生ロールを持つユーザーは試験プール作成者として追加できません
ne_np: प्रशिक्षार्थी भूमिका भएका प्रयोगकर्तालाई परीक्षा पूल सिर्जनाकर्ताको रूपमा थप्न अनुमति छैन।

# ZoomSettingNotFound
source: Zoom setting was not found.
ja_jp: ズーム設定が見つかりませんでした
ne_np: जुम सेटिङ फेला परेन।

# CompleteMandatoryLesson
source: Please complete above remaining mandatory lesson before viewing current lesson.
ja_jp: 現在のレッスンを表示する前に、残りの必須レッスンを完了してください
ne_np: हालको पाठ हेर्नु अघि कृपया माथिको बाँकी अनिवार्य पाठ पूरा गर्नुहोस्।

source: Context not found.
ja_jp: コンテキストが見つかりません
ne_np: सन्दर्भ फेला परेन।

source: Course not found.
ja_jp: コースが見つかりません
ne_np: पाठ्यक्रम फेला परेन।

# CreateLessonError
source: An error occurred while attempting to create the lesson.
ja_jp: レッスンを作成しようとしたときにエラーが発生しました
ne_np: पाठ सिर्जना गर्ने प्रयास गर्दा त्रुटि भयो।

# DeleteLevelError
source: An error occurred while trying to delete level.
ja_jp: レベルを削除しようとしたときにエラーが発生しました
ne_np: स्तर मेटाउने प्रयास गर्दा त्रुटि भयो।

# FetchLevelError
source: An error occurred while trying to fetch levels.
ja_jp: レベルを取得しようとしたときにエラーが発生しました
ne_np: स्तरहरू ल्याउन प्रयास गर्दा एउटा त्रुटि भयो।

# FileGetError
source: An error occurred while trying to get file.
ja_jp: ファイルを取得しようとしたときにエラーが発生しました
ne_np: फाइल प्राप्त गर्ने प्रयास गर्दा त्रुटि भयो।

# LessonReorderError
source: An error occurred while attempting to reorder the lessons.
ja_jp: レッスンを並べ替えようとしたときにエラーが発生しました
ne_np: पाठहरू पुन: क्रमबद्ध गर्ने प्रयास गर्दा त्रुटि भयो।

source: Lesson type not matched.
ja_jp: レッスンタイプが一致しません
ne_np: पाठको प्रकार मेल खाएन।

# LessonTypeNotMatchMeeting
source: Lesson type not match for join meeting.
ja_jp: レッスンのタイプがミーティングに参加するには一致しません
ne_np: बैठकमा सामेल हुनका लागि पाठको प्रकार मेल खाँदैन।

source: Level already exist.
ja_jp: レベルはすでに存在します
ne_np: स्तर पहिले नै अवस्थित छ।

# LevelCreateError
source: An error occurred while trying to create level.
ja_jp: レベルを作成しようとしたときにエラーが発生しました
ne_np: स्तर सिर्जना गर्ने प्रयास गर्दा त्रुटि भयो।

source: Level name already exist.
ja_jp: レベル名はすでに存在します
ne_np: स्तर नाम पहिले नै अवस्थित छ।

source: Level not found.
ja_jp: レベルが見つかりません
ne_np: स्तर फेला परेन

# LevelUpdate
source: An error occurred while trying to update level
ja_jp: レベルを更新しようとしたときにエラーが発生しました
ne_np: स्तर अद्यावधिक गर्ने प्रयास गर्दा त्रुटि भयो।

# LiveClassJoinError
source: An error occurred while trying to join live class.
ja_jp: ライブクラスに参加しようとしたときにエラーが発生しました
ne_np: लाइभ कक्षामा सामेल हुन प्रयास गर्दा एउटा त्रुटि भयो।

# MeetingNotAccessed
source: You are not allowed to access this meeting.
ja_jp: この会議へのアクセスは許可されていません
ne_np: तपाईंलाई यो बैठकमा पहुँच गर्न अनुमति छैन।

source: Meeting not found.
ja_jp: 会議が見つかりません
ne_np: बैठक भेटिएन।

source: Meeting report not found.
ja_jp: 会議レポートが見つかりません
ne_np: बैठक रिपोर्ट फेला परेन।

# StorageSettingNotConfigured
source: Storage setting is not configured
ja_jp: ストレージ設定が構成されていません
ne_np: भण्डारण सेटिङ कन्फिगर गरिएको छैन।

source: Tag not found.
ja_jp: タグが見つかりません
ne_np: ट्याग फेला परेन।

source: Teacher not found.
ja_jp: 先生が見つかりません
ne_np: शिक्षक भेटिएन ।

# UpdateLessonInformationError
source: An error occurred while attempting to update the lesson information
ja_jp: レッスン情報の更新中にエラーが発生しました
ne_np: पाठ जानकारी अपडेट गर्ने प्रयास गर्दा त्रुटि भयो

# UploadFileError
source: An error occurred while trying to upload file.
ja_jp: ファイルをアップロードしようとしているときにエラーが発生しました
ne_np: फाइल अपलोड गर्ने प्रयास गर्दा त्रुटि भयो।

source: Zoom license not found.
ja_jp: ズームライセンスが見つかりません
ne_np: जुम लाइसेन्स फेला परेन

# AssignRoleQuestionPoolError
source: An error occurred while attempting to assign role to question pool.
ja_jp: 質問プールにロールを割り当てようとしたときにエラーが発生しました
ne_np: प्रश्न पूलमा भूमिका तोक्ने प्रयास गर्दा त्रुटि भयो।

# QuestionAssociatedQuestionSet
source: Question is associated with question set.
ja_jp: 質問は質問セットに関連付けられています
ne_np: प्रश्न प्रश्न सेट संग सम्बन्धित छ।

# QuestionCannotEdit
source: Question is associated with exam submission. So, it cannot be edited.
ja_jp: 質問は試験の提出に関連しています。したがって、編集することはできません
ne_np: प्रश्न परीक्षा सबमिशन संग सम्बन्धित छ। त्यसकारण, यसलाई सम्पादन गर्न सकिँदैन।

# QuestionCreateError
source: An error occurred while attempting to create question.
ja_jp: 質問を作成しようとしたときにエラーが発生しました
ne_np: प्रश्न सिर्जना गर्ने प्रयास गर्दा त्रुटि भयो।

source: Question not found.
ja_jp: 質問が見つかりません
ne_np: प्रश्न भेटिएन।

# QuestionPoolDeleteError
source: An error occurred while attempting to delete question pool's question.
ja_jp: 質問プールの質問を削除しようとしたときにエラーが発生しました
ne_np: प्रश्न पूलको प्रश्न मेटाउने प्रयास गर्दा त्रुटि भयो।

# QuestionPoolUpdateError
source: An error occurred while attempting to update question pool's question.
ja_jp: 質問プールの質問を更新しようとしたときにエラーが発生しました
ne_np: प्रश्न पूलको प्रश्न अद्यावधिक गर्ने प्रयास गर्दा त्रुटि भयो।

# QuestionPoolUserNotFound
source: User not found in question pool.
ja_jp: 質問プールにユーザーが見つかりません
ne_np: प्रश्न पूलमा प्रयोगकर्ता फेला परेन।

# QuestionSetAddError
source: An error occurred while attempting to add questions in question set.
ja_jp: 質問セットに質問を追加しようとしたときにエラーが発生しました
ne_np: प्रश्न सेटमा प्रश्नहरू थप्ने प्रयास गर्दा त्रुटि भयो।

# QuestionSetAddNotAllowed
source: Question set contains answer submission. So, not allowed to add question in question set
ja_jp: 質問セットには回答の提出が含まれています。したがって、質問セットに質問を追加することはできません
ne_np: प्रश्न सेटमा उत्तर सबमिशन समावेश छ। त्यसैले, प्रश्न सेटमा प्रश्न थप्न अनुमति छैन।

source: Question set not found.
ja_jp: 質問セットが見つかりません
ne_np: प्रश्न सेट भेटिएन।

# TeacherRoleInvalidAccess
source: Invalid access to change question pool teacher's role.
ja_jp: 質問プールの教師の役割を変更するための無効なアクセス
ne_np: प्रश्न पूल शिक्षकको भूमिका परिवर्तन गर्न अमान्य पहुँच।

# UnauthorizedUserAddQuestion
source: Unauthorized user to add question in pool.
ja_jp: 権限のないユーザーがプールに質問を追加する
ne_np: पूलमा प्रश्न थप्नको लागि अनधिकृत प्रयोगकर्ता।

# UnauthorizedUserAddQuestionSet
source: Unauthorized user to add questions in question set.
ja_jp: 権限のないユーザーが質問セットに質問を追加する
ne_np: प्रश्न सेटमा प्रश्नहरू थप्नको लागि अनधिकृत प्रयोगकर्ता।

# UnauthorizedUserDeleteQuestion
source: Unauthorized user to delete question.
ja_jp: 権限のないユーザーが質問を削除できます
ne_np: प्रश्न मेटाउनको लागि अनधिकृत प्रयोगकर्ता।

# UnauthorizedUserQuestionSet
source: Unauthorized user to get questions in question set.
ja_jp: 質問セット内の質問を取得する権限のないユーザー
ne_np: प्रश्न सेटमा प्रश्नहरू प्राप्त गर्न अनधिकृत प्रयोगकर्ता।

# UnauthorizedUserUpdateQuestion
source: Unauthorized user to update the question.
ja_jp: 質問を更新する権限のないユーザー
ne_np: प्रश्न अपडेट गर्नको लागि अनधिकृत प्रयोगकर्ता।

# CreateTagError
source: An error occurred while trying to create tag.
ja_jp: タグの作成中にエラーが発生しました
ne_np: ट्याग सिर्जना गर्ने प्रयास गर्दा त्रुटि भयो।

# DeleteSectionError
source: An error occurred while trying to delete section.
ja_jp: セクションを削除しようとしたときにエラーが発生しました
ne_np: खण्ड मेट्ने प्रयास गर्दा त्रुटि भयो।

# DeleteTagError
source: An error occurred while trying to delete tag.
ja_jp: タグを削除しようとしたときにエラーが発生しました
ne_np: ट्याग मेटाउने प्रयास गर्दा त्रुटि भयो।

# FetchRefreshTokenError
source: An error occurred while attempting to fetch refresh token by user id.
ja_jp: ユーザー ID によるリフレッシュ トークンの取得中にエラーが発生しました
ne_np: प्रयोगकर्ता आईडीद्वारा ताजा टोकन ल्याउने प्रयास गर्दा त्रुटि भयो।

# RefreshTokenValueError
source: An error occurred while attempting to fetch refresh token by value.
ja_jp: 更新トークンを値で取得しようとしたときにエラーが発生しました
ne_np: मानद्वारा ताजा टोकन ल्याउने प्रयास गर्दा एउटा त्रुटि भयो।

# TagAlreadyExist
source: Tag name already exist.
ja_jp: タグ名はすでに存在します
ne_np: ट्याग नाम पहिले नै अवस्थित छ।

# TrainingSectionLesson
source: Training section consist lessons.
ja_jp: トレーニングセクションはレッスンで構成されています
ne_np: प्रशिक्षण खण्डमा पाठहरू समावेश छन्।

# TrainingSectionPublished
source: Training section is published.
ja_jp: トレーニングセクションが公開されました
ne_np: प्रशिक्षण खण्ड प्रकाशित छ।

# UpdateRefershTokenError
source: An error occurred while attempting to update refresh token.
ja_jp: リフレッシュトークンを更新しようとしたときにエラーが発生しました
ne_np: ताजा टोकन अपडेट गर्ने प्रयास गर्दा त्रुटि भयो।

# UpdateTagError
source: An error occurred while trying to update tag.
ja_jp: タグを更新しようとしたときにエラーが発生しました
ne_np: ट्याग अपडेट गर्ने प्रयास गर्दा त्रुटि भयो।

# AllLiscensePlaced
source: All Liscense Id have been booked, please select another instance.
ja_jp: すべてのライセンス ID が予約されています。別のインスタンスを選択してください
ne_np: सबै लाइसेन्स आईडी बुक गरिएको छ, कृपया अर्को उदाहरण चयन गर्नुहोस्।

source: Assignment review not found.
ja_jp: 課題のレビューが見つかりません
ne_np: असाइनमेन्ट समीक्षा फेला परेन।

# DuplicateQuestionPoolName
source: Duplicate question pool name is found.
ja_jp: 重複する質問プール名が見つかりました
ne_np: डुप्लिकेट प्रश्न पोखरी नाम फेला पर्यो।

# DuplicateSectionNameFound
source: Duplicate section name is found.
ja_jp: 重複したセクション名が見つかりました
ne_np: डुप्लिकेट खण्ड नाम फेला पर्यो।

# ErrorAttemptingRetrievingResult
source: An error occurred while attempting to retrieving the results.
ja_jp: 結果を取得しようとしたときにエラーが発生しました
ne_np: परिणामहरू पुन: प्राप्त गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorAttemptingSubmitExam
source: An error occurred while attempting to submit the exam.
ja_jp: 試験を提出しようとしたときにエラーが発生しました
ne_np: परीक्षा पेश गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorGettingResult
source: An error occurred while getting result details.
ja_jp: 結果の詳細を取得中にエラーが発生しました
ne_np: परिणाम विवरणहरू प्राप्त गर्दा त्रुटि भयो।

# ErrorOccurredAttemptingStartExam
source: An error occurred while attempting to start exam.
ja_jp: 試験を開始しようとしたときにエラーが発生しました
ne_np: परीक्षा सुरु गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredDeleteAssignmentReview
source: An error occurred while trying to delete assignment review.
ja_jp: 課題レビューを削除しようとしたときにエラーが発生しました
ne_np: असाइनमेन्ट समीक्षा मेटाउने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredOnMinioCredentails
source: An error occurred while attempting to get the minio credentials.
ja_jp: Minio 資格情報を取得しようとしたときにエラーが発生しました
ne_np: Minio credentials प्राप्त गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredOnUploadFile
source: An error occurred while attempting to upload file to the server.
ja_jp: ファイルをサーバーにアップロードしようとしたときにエラーが発生しました
ne_np: सर्भरमा फाइल अपलोड गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredUpdateAssignment
source: An error occurred while trying to update assignment.
ja_jp: 割り当てを更新しようとしたときにエラーが発生しました
ne_np: असाइनमेन्ट अपडेट गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOccurredVerifyResetToken
source: An error occurred while attempting to verify reset token.
ja_jp: リセット トークンを検証しようとしたときにエラーが発生しました
ne_np: रिसेट टोकन प्रमाणीकरण गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorOnCalculateTrainingPercentage
source: An error occurred while trying to calculate training completed percentage.
ja_jp: トレーニング完了率を計算しようとしたときにエラーが発生しました
ne_np: तालिम पूरा भएको प्रतिशत गणना गर्ने प्रयास गर्दा त्रुटि भयो।

# ErrorRetrievingStudentResult
source: An error occurred while attempting to retrieving the student result.
ja_jp: 生徒の結果を取得しようとしたときにエラーが発生しました
ne_np: विद्यार्थीको नतिजा पुन: प्राप्त गर्ने प्रयास गर्दा एउटा त्रुटि भयो।

# ErrorUpdateWatchHistory
source: An error occurred while trying to update watch history.
ja_jp: 視聴履歴を更新しようとしたときにエラーが発生しました
ne_np: हेराइको इतिहास अपडेट गर्ने प्रयास गर्दा त्रुटि भयो।

source: Exam already finished.
ja_jp: "試験はすでに終了しました。
ne_np: परीक्षा पहिले नै सकियो।

source: Exam already submitted.
ja_jp: 試験はすでに提出済みです
ne_np: परीक्षा पहिले नै पेश गरिएको छ।
