Repository: academykit/academykit
Catalog: Application/ValidatorLocalization/ValidatorLocalizer.*.resx
Languages: ne_np

# AddressLength200
source: Address length must be less than or equal to 200 characters.
ne_np: ठेगाना लम्बाइ 200 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# OAuthAccountIdLength100
source: OAuth Account Id length must be less than or equal to 100 characters.
ne_np: OAuth खाता आईडी लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# OAuthAccountIdRequired
source: OAuth Account Id is required.
ne_np: OAuth खाता आईडी आवश्यक छ।

# OAuthClientIdLength100
source: OAuth Client Id length must be less than or equal to 100 characters.
ne_np: OAuth ग्राहक आईडी लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# OAuthClientIdRequired
source: OAuth Client Id is required.
ne_np: OAuth ग्राहक आईडी आवश्यक छ।

# AssignementQuestionisRequired
source: Assignment Question option is required.
ne_np: असाइनमेन्ट प्रश्न विकल्प आवश्यक छ।

# AssignmentRequired
source: Assignment name is required
ne_np: असाइनमेन्ट नाम आवश्यक छ

# Assignmenttypeid
source: Assignment type is required.
ne_np: असाइनमेन्ट प्रकार आवश्यक छ।

# BioLength200
source: Bio length must be less than or equal to 200 characters.
ne_np: बायो लम्बाइ 200 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# CapacityRequired
source: Capacity is required.
ne_np: क्षमता चाहिन्छ।

# CertificateEndTimeError
source: Certificate end date must not be greater than current date.
ne_np: प्रमाणपत्रको अन्तिम मिति हालको मिति भन्दा ठूलो हुनुहुँदैन।

# CertificateStartTimeError
source: Certificate start date must not be greater than current date.
ne_np: प्रमाणपत्र सुरु हुने समय हालको मिति भन्दा बढी हुनु हुँदैन

# CompanyAddressLengthError
source: Company address length must be less than or equal to 250 characters.
ne_np: कम्पनी ठेगाना लम्बाइ 250 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# CompanyAddressRequired
source: Company address is required.
ne_np: कम्पनी ठेगाना आवश्यक छ।

# CompanyContactNumberLengthError
source: Company contact must be less than or equal to 30 characters.
ne_np: कम्पनीको सम्पर्क ३० वर्णभन्दा कम वा बराबर हुनुपर्छ।

# CompanyContactNumberRequired
source: Company contact number is required.
ne_np: कम्पनी सम्पर्क नम्बर आवश्यक छ।

# CompanyNameLengthError
source: Company name length must be less than or equal to 250 characters.
ne_np: कम्पनीको नाम लम्बाइ 250 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# CompanyNameRequired
source: Company name is required.
ne_np: कम्पनीको नाम आवश्यक छ।

# ConfirmPasswordRequired
source: Confirm password is required.
ne_np: पासवर्ड आवश्यक छ पुष्टि गर्नुहोस्।

# ConformPassword
source: Confirm password is required.
ne_np: पासवर्ड आवश्यक छ पुष्टि गर्नुहोस्।

# ContentRequired
source: Content is required.
ne_np: सामग्री आवश्यक छ।

# CourseIdRequired
source: Required course identity.
ne_np: आवश्यक पाठ्यक्रम पहिचान।

# CourseStatusRequired
source: Required course status.
ne_np: आवश्यक पाठ्यक्रम स्थिति।

# DepartmentIdRequired
source: Department name is required.
ne_np: विभागको नाम आवश्यक छ।

# DescriptionLength500
source: Description length must be less than or equal to 5000 characters.
ne_np: वर्णन लम्बाइ 5000 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# DesignationLength50
source: Designation length should be less than or equal to 50.
ne_np: पदनाम लम्बाइ 50 भन्दा कम वा बराबर हुनुपर्छ।

# DocumentTypeRequired
source: Document is required for lesson type is document.
ne_np: अवैध पाठको लागि कागजात आवश्यक छ पाठको प्रकार कागजात प्रकार हो।

# DurationRequired
source: Duration is required.
ne_np: अवधि आवश्यक छ

# EmailLength100
source: Email length must be less than or equal to 100 characters.
ne_np: इमेल लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# EmailRequired
source: Email is required.
ne_np: इमेल आवश्यक छ।

# EmailSignatureLengthError
source: Email signature length must be less than or equal to 1000 characters.
ne_np: इमेल हस्ताक्षर लम्बाइ 1000 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# EnddateMustBeGreater
source: End date must be greater than Start date.
ne_np: अन्त्य मिति सुरु मिति भन्दा ठूलो हुनुपर्छ।

# EndTimeEmptyError
source: End date cannot be empty
ne_np: अन्तिम मिति खाली हुन सक्दैन

# EventEndDate
source: Event end date is required.
ne_np: घटना समाप्त मिति आवश्यक छ।

# EventStartDateRequired
source: Event start date is required.
ne_np: घटना सुरु मिति आवश्यक छ।

# FeedbackNameRequired
source: Feedback name is required.
ne_np: प्रतिक्रिया नाम आवश्यक छ।

# FeedbackRequired
source: Please provide feedback for all questions.
ne_np: कृपया सबै प्रश्नहरूको लागि प्रतिक्रिया प्रदान गर्नुहोस्।

# FeedbackTypeRequired
source: Feedback type is required.
ne_np: प्रतिक्रिया प्रकार आवश्यक छ।

# FileUrlLength200
source: File url length should be less than or equal to 200.
ne_np: फाइल url लम्बाइ 200 भन्दा कम वा बराबर हुनुपर्छ।

# FileUrlRequired
source: File url is required.
ne_np: फाइल url आवश्यक छ।

# FirstNameLength100
source: First name length must be less than or equal to 100 characters.
ne_np: पहिलो नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# FirstNameRequired
source: First name cannot be null
ne_np: पहिलो नाम शून्य हुन सक्दैन

# FullNameRequired
source: Full name is required.
ne_np: पूरा नाम आवश्यक छ।

# HintLength500
source: Hints length must be less than or equal to 5000 characters.
ne_np: संकेत लम्बाइ 5000 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# HostIDLength
source: Host id length must be less than or equal to 50 characters.
ne_np: होस्ट आईडी लम्बाइ 50 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# HostIdRequired
source: Host id is required.
ne_np: होस्ट आईडी आवश्यक छ।

# InvalidAssignmentMarks
source: Marks must be in between 1 to 100.
ne_np: अंकहरू 1 देखि 100 बीचमा हुनुपर्छ।

# InvalidEmailError
source: Invalid email format.
ne_np: अवैध इमेल ढाँचा।

source: Invalid feedback type.
ne_np: अमान्य प्रतिक्रिया प्रकार।

# InvalidFileType
source: Invalid assignment type.
ne_np: अवैध असाइनमेन्ट प्रकार।

# InvalidLessionType
source: Invalid lesson type.
ne_np: अमान्य पाठ प्रकार।

source: Invalid media type.
ne_np: अमान्य मिडिया प्रकार।

# InvalidPasswordFormat
source: Password should contains at least one lowercase, one uppercase, one digit and one symbol.
ne_np: पासवर्डमा कम्तिमा एउटा सानो अक्षर, एउटा ठूलो अक्षर, एउटा अंक र एउटा चिन्ह हुनुपर्छ।

source: Invalid question type.
ne_np: अवैध प्रश्न प्रकार।

# InvalidReviewLength
source: Review length should be less than or equal to 500 characters.
ne_np: समीक्षाको लम्बाइ ५०० वर्णभन्दा कम वा बराबर हुनुपर्छ।

# IsRecordingTrue
source: Is recording enabled is required.
ne_np: रेकर्डिङ सक्षम छ आवश्यक छ।

source: Key cannot be null
ne_np: कुञ्जी शून्य हुन सक्दैन

# LastNameLength100
source: Last name length must be less than or equal to 100 characters.
ne_np: अन्तिम नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# LastNAmeRequired
source: Last name is required.
ne_np: अन्तिम नाम आवश्यक छ।

# LessionNameRequired
source: Lesson name is required.
ne_np: पाठ नाम आवश्यक छ।

# LessonIdRequired
source: LessonId is required
ne_np: LessonId आवश्यक छ

# LevelRequired
source: Level is required.
ne_np: स्तर आवश्यक छ।

# LicenseEmailLength
source: License Email length must be less than or equal to 50 characters.
ne_np: लाइसेन्स इमेल लम्बाइ 50 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# LogoRequired
source: Logo is required
ne_np: लोगो आवश्यक छ

# LogoUrlRequired
source: Logo url length must be less than or equal to 500 characters.
ne_np: लोगो url लम्बाइ 500 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# MailPortRequired
source: Mail port is required
ne_np: मेल पोर्ट आवश्यक छ

# MailServerLength200
source: Mail server length must be less than or equal to 200 characters.
ne_np: मेल सर्भर लम्बाइ 200 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# MailServerRequired
source: Mail server is required.
ne_np: मेल सर्भर आवश्यक छ।

# MediaTypeRequired
source: Media type is required.
ne_np: मिडिया प्रकार आवश्यक छ।

# MeedingDurationRequired
source: Meeting duration is required.
ne_np: बैठक अवधि आवश्यक छ।

# MeetingIdDUrationLength
source: Meeting duration cannot be greater than or equal to 1439 minutes.
ne_np: बैठक अवधि 1439 मिनेट भन्दा बढी वा बराबर हुन सक्दैन।

# MessageCannotBeEmpty
source: Review message cannot be empty.
ne_np: समीक्षा सन्देश खाली हुन सक्दैन।

# MiddleNameLength100
source: Middle name length must be less than or equal to 100 characters.
ne_np: बीचको नामको लम्बाइ १०० वर्णभन्दा कम वा बराबर हुनुपर्छ।

# MobileNumberLength50
source: Mobile number length must be less than or equal to 50 characters.
ne_np: मोबाइल नम्बरको लम्बाइ ५० वर्णभन्दा कम वा बराबर हुनुपर्छ।

# NameLength250
source: Name length must be less than or equal to 250 characters.
ne_np: नाम लम्बाइ 250 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# NameLength500
source: Name length must be less than or equal to 500 characters.
ne_np: नाम लम्बाइ 500 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# NameLengthError
source: Name length must be less than or equal to 100 characters.
ne_np: नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# NameRequired
source: Name is required.
ne_np: नाम आवश्यक छ।

# NewEmailConformedRequired
source: New email and confirm email does not matched.
ne_np: नयाँ इमेल र पुष्टि इमेल मेल खाँदैन।

# NewPasswordRequired
source: New password is required
ne_np: नयाँ पासवर्ड आवश्यक छ।

# OldAndNewPasswordDoesnotMatch
source: New password and confirm password does not matched.
ne_np: नयाँ पासवर्ड र पुष्टि पासवर्ड मिलेन।

# OldEmailRequired
source: Old email is required.
ne_np: पुरानो इमेल आवश्यक छ।

# OneOptionShouldBeCreated
source: At least one option should be provided as correct.
ne_np: कम्तिमा एक विकल्प सही रूपमा प्रदान गर्नुपर्छ।

source: Option is required.
ne_np: विकल्प आवश्यक छ।

# OptionLengthMustBe5000
source: Option length must be less than or equal to 5000 characters.
ne_np: विकल्प लम्बाइ 5000 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# OptionMoreThanOne
source: Option should be more than one.
ne_np: विकल्प एक भन्दा बढी हुनुपर्छ।

source: Password change token is required.
ne_np: पासवर्ड परिवर्तन टोकन आवश्यक छ।

# PasswordLength100
source: Password length must be less than or equal to 100 characters.
ne_np: पासवर्ड लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# PasswordRequired
source: Password is required.
ne_np: पासवर्ड आवश्यक छ।

# ProfessionLength200
source: Profession length must be less than or equal to 200 characters.
ne_np: पेशाको लम्बाइ 200 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# PublicUrlLength2000
source: Public url length must be less than or equal to 2000 characters.
ne_np: सार्वजनिक url लम्बाइ 2000 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# FatherNameLength100
source: Father name length must be less than or equal to 100 characters.
ne_np: पिताको नामको लम्बाइ १०० वा तदुन्ध भन्दा कम गर्नुपर्छ।

# FatherNameRequired
source: Father name is required.
ne_np: पिताको नाम आवश्यक छ।

# MotherNameLength100
source: Mother name length must be less than or equal to 100 characters.
ne_np: आमाको नामको लम्बाइ १०० वा तदुन्ध भन्दा कम गर्नुपर्छ।

# MotherNameRequired
source: Mother name is required.
ne_np: आमाको नाम आवश्यक छ।

# SpouseNameLength100
source: Spouse name length must be less than or equal to 100 characters.
ne_np: पति/पत्नि को नामको लम्बाइ १०० वा तदुन्ध भन्दा कम गर्नुपर्छ।

# SpouseNameRequired
source: Spouse name is required.
ne_np: पति/पत्नि को नाम आवश्यक छ।

# GrandfatherNameLength100
source: Grandfather name length must be less than or equal to 100 characters.
ne_np: बाजेको नामको लम्बाइ १०० वा तदुन्ध भन्दा कम गर्नुपर्छ।

# GrandfatherNameRequired
source: Grandfather name is required.
ne_np: बाजेको नाम आवश्यक छ।

# GenderRequired
source: Gender is required.
ne_np: लिङ्ग आवश्यक छ।

# QuestionHint5000Length
source: Question hints length must be less than or equal to 5000 characters.
ne_np: प्रश्न संकेत लम्बाइ 5000 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# QuestionMarkingRequired
source: Question marking is required.
ne_np: प्रश्न मूल्याङ्कन आवश्यक छ।

# QuestionpoolIdRequired
source: Question pool identity is required.
ne_np: प्रश्न पोखरी पहिचान आवश्यक छ।

# QuestionPoolNameRequired
source: Question pool name is required.
ne_np: प्रश्न पोखरी नाम आवश्यक छ।

# RejectMessageRequired
source: Required rejected message.
ne_np: अस्वीकृत सन्देश आवश्यक छ।

# ReplyToLength200
source: Reply to length must be less than or equal to 200 characters.
ne_np: लम्बाइको जवाफ 200 वर्णहरू भन्दा कम वा बराबर हुनुपर्छ।

# ReplyToRequired
source: Reply to is required.
ne_np: जवाफ आवश्यक छ।

# RetakeMustBeGreaterThan0
source: Allowed retake must be greater than 0.
ne_np: पुन: प्राप्त गर्न अनुमति दिइएको ० भन्दा बढी हुनुपर्छ।

# RoleRequired
source: Role is required.
ne_np: भूमिका आवश्यक छ।

# SdkKeyLength100
source: Sdk key length must be less than or equal to 100 characters.
ne_np: Sdk कुञ्जीको लम्बाइ १०० वर्णभन्दा कम वा बराबर हुनुपर्छ।

# SDKKeyRequired
source: Sdk key is required.
ne_np: Sdk कुञ्जी आवश्यक छ।

# SdkLength100
source: Sdk secret name length must be less than or equal to 100 characters.
ne_np: Sdk गोप्य नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# SdkSecretRequired
source: Sdk secret is required.
ne_np: Sdk गोप्य आवश्यक छ।

# SectionIdRequired
source: Section identity is required.
ne_np: खण्ड पहिचान आवश्यक छ।

# SectionNameLength
source: Section name length must be less than or equal to 100 characters.
ne_np: खण्ड नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# SectionNameRequired
source: Section name is required.
ne_np: खण्डको नाम आवश्यक छ।

# SelectFileType
source: Please select the file.
ne_np: कृपया फाइल चयन गर्नुहोस्।

# SelectGroup
source: Please select group.
ne_np: कृपया समूह चयन गर्नुहोस्।

# SelectOneCorrectAnswer
source: Question type with single choice can have only one option correct.
ne_np: एकल विकल्प सहितको प्रश्न प्रकारमा एउटा मात्र विकल्प सही हुन सक्छ।

# SenderEmailLength200
source: Sender email length must be less than or equal to 200 characters.
ne_np: प्रेषक इमेल लम्बाइ 200 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# SenderEmailRequired
source: Sender email is required.
ne_np: प्रेषक इमेल आवश्यक छ।

# SenderName200
source: Sender name length must be less than or equal to 200 characters.
ne_np: प्रेषकको नाम लम्बाइ 200 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# SenderNameRequired
source: Sender name is required.
ne_np: मेल पोर्ट आवश्यक छ

# StartdateEmptyError
source: Startdate cannot be empty
ne_np: सुरु मिति खाली हुन सक्दैन

# StartDateFormat
source: startdate must be in format YYYY-MM-DD
ne_np: शुरुवात मिति YYYY-MM-DD ढाँचामा हुनुपर्छ

# timeSpanIssue
source: Event end date must be greater than or equal to event start date.
ne_np: घटनाको अन्त्य मिति घटना सुरु मिति भन्दा ठूलो वा बराबर हुनुपर्छ।

# TitleLenghtIssue
source: Title length must be less than or equal to 100.
ne_np: शीर्षक लम्बाइ 100 भन्दा कम वा बराबर हुनुपर्छ।

# TrainingIdRequired
source: Training identity is required.
ne_np: प्रशिक्षण पहिचान आवश्यक छ।

# UserIDrequired
source: User id is required
ne_np: प्रयोगकर्ता आईडी आवश्यक छ

# UserNameLength100
source: User name length must be less than or equal to 100 characters.
ne_np: प्रयोगकर्ता नाम लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

# UserNameRequired
source: User name is required.
ne_np: प्रयोगकर्ता नाम आवश्यक छ।

# ValidPercentageRange
source: Percentage should be in between 0 to 100.
ne_np: प्रतिशत 0 देखि 100 बीचमा हुनुपर्छ।

# ValueCannotBeNullOrEmpty
source: Value cannot be null
ne_np: मान शून्य वा खाली हुन सक्दैन

# VideoIsRequired
source: Video is required for lesson type is video or recorded video.
ne_np: पाठको लागि भिडियो आवश्यक छ भिडियो वा रेकर्ड गरिएको भिडियो हो।

# ZoomLicenseEmailRequired
source: Zoom license email is required.
ne_np: जुम लाइसेन्स इमेल आवश्यक छ।

# ZoomLicenseRequired
source: Please select zoom license.
ne_np: कृपया जुम इजाजतपत्र चयन गर्नुहोस्।

# OAuthClientSecretRequired
source: OAuth Client Secret is required.
ne_np: OAuth ग्राहक गोप्य आवश्यक छ।

# OAuthClientSecretLength100
source: OAuth Client Secret length must be less than or equal to 100 characters.
ne_np: OAuth ग्राहक गोप्य लम्बाइ 100 वर्ण भन्दा कम वा बराबर हुनुपर्छ।

source: Optional cost cannot be null.
ne_np: वैकल्पिक लागत शून्य हुन सक्दैन।

# InvalidMobileNumber
source: Invalid mobile number format.
ne_np: अवैध मोबाइल नम्बर ढाँचा।

# NoOfQuestionSelectionExceeds
source: Number Of Question Selection Exceeds.
ne_np: प्रश्न चयनको सङ्ख्या बढी छ ।
